In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv("data3.csv")
df

     CustomerID   Genre  Age  Annual Income  Spending Score
0             1    Male   19          19000               0
1             2    Male   35          20000               0
2             3  Female   26          43000               0
3             4  Female   27          57000               0
4             5    Male   19          76000               0
..          ...     ...  ...            ...             ...
194         195    Male   28          89000               0
195         196    Male   34          43000               0
196         197  Female   30          79000               0
197         198  Female   20          36000               0
198         199    Male   26          80000               0

[199 rows x 5 columns]

In [5]:
mean_age = df['Age'].mean()
print("Mean age:", mean_age)

Mean age: 30.306532663316585

In [3]:
df.mean(numeric_only=True)

CustomerID          100.000000
Age                  30.306533
Annual Income     60633.165829
Spending Score        0.130653
dtype: float64

In [9]:
df.loc[:,'Age'].mean(numeric_only=True)

30.306532663316585

In [10]:
df.mean(axis=1,numeric_only=True)[0:4]

0     4755.00
1     5009.25
2    10757.25
3    14257.75
dtype: float64

In [13]:
df.median(numeric_only=True)

CustomerID          100.0
Age                  29.0
Annual Income     59000.0
Spending Score        0.0
dtype: float64

In [16]:
df.loc[:,'Age'].median(numeric_only=True)

29.0

In [19]:
df.median(axis=1,numeric_only=True)[0:4]

0    10.0
1    18.5
2    14.5
3    15.5
dtype: float64

In [20]:
df.mode()

     CustomerID Genre   Age  Annual Income  Spending Score
0             1  Male  35.0        80000.0             0.0
1             2   NaN   NaN            NaN             NaN
2             3   NaN   NaN            NaN             NaN
3             4   NaN   NaN            NaN             NaN
4             5   NaN   NaN            NaN             NaN
..          ...   ...   ...            ...             ...
194         195   NaN   NaN            NaN             NaN
195         196   NaN   NaN            NaN             NaN
196         197   NaN   NaN            NaN             NaN
197         198   NaN   NaN            NaN             NaN
198         199   NaN   NaN            NaN             NaN

[199 rows x 5 columns]

In [21]:
df.loc[:,'Age'].mode()

0    35
Name: Age, dtype: int64

In [22]:
df.min()

CustomerID             1
Genre             Female
Age                   18
Annual Income      15000
Spending Score         0
dtype: object

In [23]:
df.max()

CustomerID           199
Genre               Male
Age                   59
Annual Income     150000
Spending Score         1
dtype: object

In [26]:
df.loc[:,'Age'].max(skipna = False)

59

In [27]:
df.std(numeric_only=True)

CustomerID           57.590508
Age                   7.465849
Annual Income     30848.949453
Spending Score        0.337871
dtype: float64

In [28]:
df.loc[:,'Age'].std()

7.465848679334158

In [29]:
df.std(axis=1,numeric_only=True)[0:4]

0     9496.670680
1     9993.846219
2    21495.169804
3    28494.835817
dtype: float64

In [30]:
df.groupby(['Genre'])['Age'].mean(numeric_only=True)

Genre
Female    29.884211
Male      30.692308
Name: Age, dtype: float64

In [33]:
df_u=df.rename(columns= {'Annual Income':'Income'},inplace=False)
df_u.groupby(['Genre']).Income.mean()

Genre
Female    61673.684211
Male      59682.692308
Name: Income, dtype: float64

In [34]:
from sklearn import preprocessing
enc = preprocessing.OneHotEncoder()
enc_df = pd.DataFrame(enc.fit_transform(df[['Genre']]).toarray())
enc_df

       0    1
0    0.0  1.0
1    0.0  1.0
2    1.0  0.0
3    1.0  0.0
4    0.0  1.0
..   ...  ...
194  0.0  1.0
195  0.0  1.0
196  1.0  0.0
197  1.0  0.0
198  0.0  1.0

[199 rows x 2 columns]

In [35]:
df_encode =df_u.join(enc_df)
df_encode

     CustomerID   Genre  Age  Income  Spending Score    0    1
0             1    Male   19   19000               0  0.0  1.0
1             2    Male   35   20000               0  0.0  1.0
2             3  Female   26   43000               0  1.0  0.0
3             4  Female   27   57000               0  1.0  0.0
4             5    Male   19   76000               0  0.0  1.0
..          ...     ...  ...     ...             ...  ...  ...
194         195    Male   28   89000               0  0.0  1.0
195         196    Male   34   43000               0  0.0  1.0
196         197  Female   30   79000               0  1.0  0.0
197         198  Female   20   36000               0  1.0  0.0
198         199    Male   26   80000               0  0.0  1.0

[199 rows x 7 columns]

In [37]:
iris = pd.read_csv("data3.csv")
iris

     CustomerID   Genre  Age  Annual Income  Spending Score
0             1    Male   19          19000               0
1             2    Male   35          20000               0
2             3  Female   26          43000               0
3             4  Female   27          57000               0
4             5    Male   19          76000               0
..          ...     ...  ...            ...             ...
194         195    Male   28          89000               0
195         196    Male   34          43000               0
196         197  Female   30          79000               0
197         198  Female   20          36000               0
198         199    Male   26          80000               0

[199 rows x 5 columns]

In [44]:
irisSet = (iris['Age'] == 'Iris-setosa')

In [ ]:
print('Iris-setosa')
print(iris[irisSet].describe())

Iris-setosa
       CustomerID  Age  Annual Income  Spending Score
count         0.0  0.0            0.0             0.0
mean          NaN  NaN            NaN             NaN
std           NaN  NaN            NaN             NaN
min           NaN  NaN            NaN             NaN
25%           NaN  NaN            NaN             NaN
50%           NaN  NaN            NaN             NaN
75%           NaN  NaN            NaN             NaN
max           NaN  NaN            NaN             NaN

In [42]:
irisVer = (iris['Age']== 'Iris-versicolor')

In [43]:
print('Iris-versicolor')
print(iris[irisVer].describe())

Iris-versicolor
       CustomerID  Age  Annual Income  Spending Score
count         0.0  0.0            0.0             0.0
mean          NaN  NaN            NaN             NaN
std           NaN  NaN            NaN             NaN
min           NaN  NaN            NaN             NaN
25%           NaN  NaN            NaN             NaN
50%           NaN  NaN            NaN             NaN
75%           NaN  NaN            NaN             NaN
max           NaN  NaN            NaN             NaN

In [46]:
irisVir = (iris['Age']== 'Iris-virginica')

In [47]:
print('Iris-virginica')
print(iris[irisVir].describe())

Iris-virginica
       CustomerID  Age  Annual Income  Spending Score
count         0.0  0.0            0.0             0.0
mean          NaN  NaN            NaN             NaN
std           NaN  NaN            NaN             NaN
min           NaN  NaN            NaN             NaN
25%           NaN  NaN            NaN             NaN
50%           NaN  NaN            NaN             NaN
75%           NaN  NaN            NaN             NaN
max           NaN  NaN            NaN             NaN